app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users` WHERE `users`.`email` = 'jcarlosraymundo@gmail.com'
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Juan Carlos', 'jcarlosraymundo@gmail.com', '$2a$10$TaVNB/Vx7X5nh6q4EEvKBOBNwwbtndgbvyUZeN/NG/1m4mn78dHGG', '2016-05-14 18:07:48', '2016-05-14 18:07:48')
---
    def create
	    puts 'inicio ============================================'
	    puts user_params[:email]
	    puts 'fin ==============================================='
	    correo = user_params[:email]
	    chek = User.where(email: correo)

	    if chek.nil? || chek.empty?
    		user = User.new(user_params)
			if user.save